Installation.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2020-05-10 dim. 14:01 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Installation</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Firmin Martin">
<link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">Installation</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org891ac3b">1. Manual</a></li>
<li><a href="#org3525553">2. <code>quelpa-use-package</code></a></li>
</ul>
</div>
</nav>
<p>
Before this package get into MELPA, there are two alternatives to install
<code>org-glaux</code> : manually or with <code>quelpa-use-package</code>. The recommended
configuration can be found below.
</p>

<div id="outline-container-org891ac3b" class="outline-2">
<h2 id="org891ac3b"><span class="section-number-2">1</span> Manual</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><code>git clone https://github.com/firmart/git-glaux ~/.emacs.d/lisp/git-glaux</code></li>
</ul>


<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">use-package</span> <span class="org-constant">org-glaux</span>
    <span class="org-builtin">:pin</span> manual
    <span class="org-builtin">:load-path</span> <span class="org-string">"lisp/org-glaux/"</span>
    <span class="org-builtin">:bind</span> (<span class="org-string">"C-c w"</span> . org-glaux-index)
    <span class="org-builtin">:config</span> 
    <span class="org-comment-delimiter">;; </span><span class="org-comment">Wikis location. default: '("~/org/wiki")</span>
    (<span class="org-keyword">setq</span> org-glaux-location-list '(<span class="org-string">"~/Org/wiki"</span> <span class="org-string">"~/Org/wiki2"</span>)) 
    <span class="org-comment-delimiter">;; </span><span class="org-comment">Destination to generate backup. default: nil</span>
    (<span class="org-keyword">setq</span> org-glaux-backup-location <span class="org-string">"~/Org/wiki/index/"</span>)
    <span class="org-comment-delimiter">;; </span><span class="org-comment">Enable org-glaux menu. Optional.</span>
    (org-glaux-menu-enable))
</pre>
</div>
</div>
</div>

<div id="outline-container-org3525553" class="outline-2">
<h2 id="org3525553"><span class="section-number-2">2</span> <code>quelpa-use-package</code></h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><code>M-x package-install RET quelpa-use-package RET</code></li>
<li>Make sure your have <code>(require 'quelpa)</code> and <code>(require 'quelpa-use-package)</code> 
somewhere in your configuration (or equivalently with <code>use-package</code>).</li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">use-package</span> <span class="org-constant">org-glaux</span>
  <span class="org-builtin">:quelpa</span> (org-glaux <span class="org-builtin">:repo</span> <span class="org-string">"firmart/org-glaux"</span> <span class="org-builtin">:fetcher</span> github)
  <span class="org-builtin">:config</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">Wikis location. default: '("~/org/wiki")</span>
  (<span class="org-keyword">setq</span> org-glaux-location-list '(<span class="org-string">"~/Org/wiki"</span> <span class="org-string">"~/Org/wiki2"</span>)) 
  <span class="org-comment-delimiter">;; </span><span class="org-comment">Destination to generate backup. default: nil</span>
  (<span class="org-keyword">setq</span> org-glaux-backup-location <span class="org-string">"~/Org/wiki/index/"</span>)
  <span class="org-comment-delimiter">;; </span><span class="org-comment">Enable org-glaux menu. Optional.</span>
  (org-glaux-menu-enable)) 
</pre>
</div>
</div>
</div>
</div>
</body>
</html>
